{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "ragged": false,
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "conv1_pad",
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1_pad"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7,
                        7
                    ],
                    "name": "conv1_conv",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1_pad",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv1_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv1_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1_relu"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "pool1_pad",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pool1_pad"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "pool1_pool",
                    "padding": "valid",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "pool1_pad",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pool1_pool"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block1_1_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "pool1_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_1_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block1_1_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_1_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_1_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block1_1_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_1_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_1_relu"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2_block1_2_conv",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_2_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block1_2_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_2_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_2_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block1_2_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_2_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_2_relu"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block1_0_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "pool1_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_0_conv"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block1_3_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_2_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_3_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block1_0_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_0_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_0_bn"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block1_3_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_3_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_3_bn"
            },
            {
                "class_name": "Add",
                "config": {
                    "dtype": "float32",
                    "name": "conv2_block1_add",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_0_bn",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2_block1_3_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_add"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block1_out",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block1_out"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block2_1_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_out",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_1_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block2_1_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_1_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_1_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block2_1_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_1_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_1_relu"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2_block2_2_conv",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_2_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block2_2_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_2_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_2_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block2_2_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_2_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_2_relu"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block2_3_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_2_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_3_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block2_3_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_3_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_3_bn"
            },
            {
                "class_name": "Add",
                "config": {
                    "dtype": "float32",
                    "name": "conv2_block2_add",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block1_out",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2_block2_3_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_add"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block2_out",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block2_out"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block3_1_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_out",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_1_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block3_1_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_1_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_1_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block3_1_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_1_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_1_relu"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2_block3_2_conv",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_2_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block3_2_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_2_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_2_bn"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block3_2_relu",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_2_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_2_relu"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2_block3_3_conv",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_2_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_3_conv"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": [
                        3
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 1.001e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "conv2_block3_3_bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_3_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_3_bn"
            },
            {
                "class_name": "Add",
                "config": {
                    "dtype": "float32",
                    "name": "conv2_block3_add",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block2_out",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2_block3_3_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_add"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "conv2_block3_out",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2_block3_add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2_block3_out"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv3_block1_1_conv",
